In [1]:
import pandas as pd

In [18]:
df = pd.read_csv('nba.csv')

In [19]:
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [20]:
df["Age"]

0      25.0
1      25.0
2      27.0
3      22.0
4      29.0
       ...
452    20.0
453    26.0
454    24.0
455    26.0
456    26.0
Name: Age, Length: 457, dtype: float64

In [24]:
df[(df["Age"] >= 30) & (df["College"] == "Duke")]["Name"].count()

5

In [26]:
df["Position"].value_counts()

Position
SG    102
PF    100
PG     92
SF     85
C      78
Name: count, dtype: int64

In [27]:
df["Salary"].max()

25000000.0

In [28]:
df[["Position", "Salary"]].max()

Position            SG
Salary      25000000.0
dtype: object

In [33]:
df['Salary'].nlargest(5).mean()

23079518.8

In [35]:
df[df["Salary"] >= 23079518.8]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
109,Kobe Bryant,Los Angeles Lakers,24.0,SF,37.0,6-6,212.0,NaN,25000000.0

In [36]:
df[["Position", "Weight"]].value_counts()

Position  Weight
PF        240.0     17
          250.0     15
PG        200.0     14
SG        220.0     14
PG        190.0     13
                    ..
          217.0      1
          208.0      1
PF        243.0      1
PG        203.0      1
SG        234.0      1
Name: count, Length: 149, dtype: int64

In [39]:
df[df["Team"] == "Toronto Raptors"]["Age"].max()

36.0

In [40]:
df[(df["Salary"] > 1200000) & (df["Age"] >30)].count()

Name        68
Team        68
Number      68
Position    68
Age         68
Height      68
Weight      68
College     49
Salary      68
dtype: int64

In [43]:
df["College"].value_counts()

College
Kentucky           22
Duke               20
Kansas             18
North Carolina     16
UCLA               15
                   ..
Utah Valley         1
Cleveland State     1
Iowa State          1
Florida State       1
Baylor              1
Name: count, Length: 118, dtype: int64

In [45]:
df[["Team","College"]].value_counts()

Team                College
Phoenix Suns        Kentucky          4
Memphis Grizzlies   North Carolina    3
Miami Heat          Duke              3
Sacramento Kings    Kentucky          3
Washington Wizards  Kansas            3
                                     ..
Houston Rockets     Charleston        1
                    Arkansas          1
                    Arizona State     1
                    Arizona           1
Washington Wizards  Virginia Tech     1
Name: count, Length: 336, dtype: int64

In [47]:
df[df["College"] == "Duke"].count()

Name        20
Team        20
Number      20
Position    20
Age         20
Height      20
Weight      20
College     20
Salary      18
dtype: int64

In [48]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [54]:
(df[(df["Team"] == "New York Knicks")]).count()

Name        16
Team        16
Number      16
Position    16
Age         16
Height      16
Weight      16
College     11
Salary      16
dtype: int64

In [56]:
df[df["College"] == "UCLA"]["Salary"].mean()

5804272.142857143

In [58]:
df["Team"].value_counts()

Team
New Orleans Pelicans      19
Memphis Grizzlies         18
New York Knicks           16
Milwaukee Bucks           16
Boston Celtics            15
Brooklyn Nets             15
Portland Trail Blazers    15
Oklahoma City Thunder     15
Denver Nuggets            15
Washington Wizards        15
Miami Heat                15
Charlotte Hornets         15
Atlanta Hawks             15
San Antonio Spurs         15
Houston Rockets           15
Dallas Mavericks          15
Indiana Pacers            15
Detroit Pistons           15
Cleveland Cavaliers       15
Chicago Bulls             15
Sacramento Kings          15
Phoenix Suns              15
Los Angeles Lakers        15
Los Angeles Clippers      15
Golden State Warriors     15
Toronto Raptors           15
Philadelphia 76ers        15
Utah Jazz                 15
Orlando Magic             14
Minnesota Timberwolves    14
Name: count, dtype: int64

In [64]:
df[["Name", "Weight"]]

              Name  Weight
0    Avery Bradley   180.0
1      Jae Crowder   235.0
2     John Holland   205.0
3      R.J. Hunter   185.0
4    Jonas Jerebko   231.0
..             ...     ...
452     Trey Lyles   234.0
453   Shelvin Mack   203.0
454      Raul Neto   179.0
455   Tibor Pleiss   256.0
456    Jeff Withey   231.0

[457 rows x 2 columns]

In [62]:
df["Weight"].max()

307.0

In [67]:
df[df["Name"] == "Nikola Pekovic"]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
405,Nikola Pekovic,Minnesota Timberwolves,14.0,C,30.0,6-11,307.0,NaN,12100000.0

In [68]:
df["Team"].max()

'Washington Wizards'

In [72]:
df[["Team"]].value_counts()

Team
New Orleans Pelicans      19
Memphis Grizzlies         18
New York Knicks           16
Milwaukee Bucks           16
Atlanta Hawks             15
Utah Jazz                 15
Toronto Raptors           15
San Antonio Spurs         15
Sacramento Kings          15
Portland Trail Blazers    15
Phoenix Suns              15
Philadelphia 76ers        15
Oklahoma City Thunder     15
Boston Celtics            15
Miami Heat                15
Los Angeles Lakers        15
Los Angeles Clippers      15
Indiana Pacers            15
Houston Rockets           15
Golden State Warriors     15
Detroit Pistons           15
Denver Nuggets            15
Dallas Mavericks          15
Cleveland Cavaliers       15
Chicago Bulls             15
Charlotte Hornets         15
Brooklyn Nets             15
Washington Wizards        15
Minnesota Timberwolves    14
Orlando Magic             14
Name: count, dtype: int64

In [73]:
df[["Height", "Position"]].max()

Height      7-3
Position     SG
dtype: object

In [77]:
df[df["Position"] == "SF"]["Height"].max()

'6-9'

In [78]:
df[df["Team"] == "Toronto Raptors"]["Age"].max()

36.0

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB